In [1]:
import sqlite3
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('/Users/ilamosin/abTest_pet/app_logs.csv', parse_dates=['date'])
df.head(5)

,date,user_id,exp_group,session_id,session_length,device,order_cnt,price,quantity_cnt
0,2022-06-21,1727468184902936832,0,16557919071727468184902936832,1752,mobile,0,0.0,0
1,2022-06-21,3556219827372626733,0,16558186423556219827372626733,86,mobile,0,0.0,0
2,2022-06-21,2136855388003761026,0,16558402842136855388003761026,222,mobile,0,0.0,0
3,2022-06-21,4593970126020001597,0,16558003654593970126020001597,400,mobile,0,0.0,0
4,2022-06-21,3962568860806737949,1,16558324233962568860806737949,1300,mobile,0,0.0,0

## EDA (exploratory data analysis)

We released new interface feature on all platforms and want to know is it helpful for our users and is there profit for our product and business.

date - дата 
user_id - айди пользователя
exp_group - группа (тестовая/контрольная)
session_id - айди сессии 
session_length - длинна сессии 
device - устройство
order_cnt - количество заказов 
price - суммарная стоимость
quantity_cnt - количество заказанных позиций?

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 269142 entries, 0 to 269141
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   date            269142 non-null  datetime64[ns]
 1   user_id         269142 non-null  int64
 2   exp_group       269142 non-null  int64
 3   session_id      269142 non-null  object
 4   session_length  269142 non-null  int64
 5   device          269142 non-null  object
 6   order_cnt       269142 non-null  int64
 7   price           269142 non-null  float64
 8   quantity_cnt    269142 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(5), object(2)
memory usage: 18.5+ MB

In [4]:
print(f'Devices which users use: {df.device.unique()}')
print(f'Unique users count: {df.user_id.nunique()}')
print(f'Unique session count: {df.session_id.nunique()}')
print(f'Max date: {df.date.max()}')
print(f'Min date: {df.date.min()}')
print(f'Diff between count session_id and unique session_id : {df.session_id.count()-df.session_id.nunique()}')

Devices which users use: ['mobile' 'desktop' 'tablet']
Unique users count: 68287
Unique session count: 267929
Max date: 2022-07-13 00:00:00
Min date: 2022-06-21 00:00:00
Diff between count session_id and unique session_id : 1213

We have diff between count session_id and unique session_id, its mau meen that one user have more then one action at one session. Lets check it.

In [5]:
two_more_sess = df\
    .groupby(['user_id', 'session_id', 'device'])\
    .agg({'session_id':'count'})\
    .rename(columns={'session_id':'count_s'})\
    .query('count_s>1')\
    .sort_values('count_s',  ascending=False)\
    .reset_index()\
    .head(20)

In [6]:
two_more_sess

                user_id                     session_id   device  count_s
0     16965268489840455    165584166516965268489840455  desktop        2
1   6188767753121332219  16571344236188767753121332219  desktop        2
2   6179372293126118898  16574857006179372293126118898   mobile        2
3   6178250370357987265  16558445156178250370357987265   mobile        2
4   6162080960945238324  16573105496162080960945238324  desktop        2
5   6162080960945238324  16572272406162080960945238324  desktop        2
6   6162080960945238324  16562757896162080960945238324  desktop        2
7   6157659880517790061  16567937066157659880517790061  desktop        2
8   6157032325675880426  16570546826157032325675880426   mobile        2
9   6149419174013868201  16575728676149419174013868201  desktop        2
10  6147487151702887366  16558399786147487151702887366  desktop        2
11  6138613225268086257  16570512376138613225268086257  desktop        2
12  6137510642755099987  16567945666137510642755099987  desktop        2
13  6126852092874456378  16574866836126852092874456378  desktop        2
14  6115587785340822870  16570544446115587785340822870   mobile        2
15  6108630853158930717  16558438876108630853158930717  desktop        2
16  6095234008307838377  16562764596095234008307838377  desktop        2
17  6180726904333254161  16569673066180726904333254161  desktop        2
18  6201061431287574149  16568809916201061431287574149  desktop        2
19  6087415308146188769  16567944336087415308146188769   mobile        2

In [7]:
df[df['session_id']=='16569673066180726904333254161']

,date,user_id,exp_group,session_id,session_length,device,order_cnt,price,quantity_cnt
157890,2022-07-04,6180726904333254161,1,16569673066180726904333254161,1065,desktop,0,0.0,0
175317,2022-07-05,6180726904333254161,1,16569673066180726904333254161,1958,desktop,0,0.0,0

In [8]:
df[df['session_id']=='16567944336087415308146188769']

,date,user_id,exp_group,session_id,session_length,device,order_cnt,price,quantity_cnt
143798,2022-07-02,6087415308146188769,1,16567944336087415308146188769,1149,mobile,0,0.0,0
149475,2022-07-03,6087415308146188769,1,16567944336087415308146188769,895,mobile,0,0.0,0

The reason why we have duplicated session_id at the moment it is difficult to explain. Maybe we have some bug.

We have product where users make orders. Maybe something like marketplace. 
Users can make their orders from devices like mobile, desktop, tablet.
Signals which we have: session_length, order_cnt, price, quantity_cnt

Now lets aggregate signals to the metriсs, some of it - average check, asl(Average session length), arpu, arppu, count of session, Total number of orders

Using sql for this

conversion: 
conversion to payment 

users:
arppu = sum(price)/sum(user_id which make order)
arpu = sum(price)/sum(user_id) 
asl = ((sum sessions length)/(sum count ssessions))
count of session = count of seesion on one user

ratio metrics:
average check = sum(price)/count(price)
average number of orders in the check
percentage of sessions that ended in payment

## Aggregating signals to the metrics

In [30]:
con = sqlite3.connect('db')

In [31]:
df.to_sql('metrics', con, index=False, if_exists='replace')

269142

In [295]:
sql = '''
with cte as (
    SELECT
        date, 
        exp_group,
        user_id,
        session_id,
        session_length,
        order_cnt,
        price,
        quantity_cnt,
        IIF(sum(price)>0, 1, 0) AS conversion 
    FROM
        metrics
    GROUP BY
        date,
        exp_group,
        user_id,
        session_id
)
SELECT
    DATE(date) as date, 
    exp_group,
    user_id,
    conversion,
    session_id,
    sum(session_length) as sum_ses_len,
    ROUND((sum(price)),2) as rev,
    sum(quantity_cnt) as sum_quant,
    CAST(((((COUNT(CASE WHEN price>0 THEN 1 END))*0.1)/count(session_id))*1000) as INT) as p_secs_pay_ses
FROM
    cte
GROUP BY
    user_id,
    date
'''

In [296]:
df_f = pd.read_sql(sql, con)

In [297]:
df_f

,date,exp_group,user_id,conversion,session_id,sum_ses_len,rev,sum_quant,p_secs_pay_ses
0,2022-07-06,0,125741107230500,0,1657093005125741107230500,1037,0.00,0,0
1,2022-07-05,0,667585499425385,0,1657003845667585499425385,432,0.00,0,0
2,2022-07-11,0,681720336100105,0,1657485675681720336100105,4453,0.00,0,0
3,2022-06-30,1,767791454221621,0,1656573195767791454221621,89,0.00,0,0
4,2022-07-04,1,767791454221621,0,1656928523767791454221621,220,0.00,0,0
...,...,...,...,...,...,...,...,...,...
188844,2022-07-07,1,9223272807582961860,1,16571695339223272807582961860,1488,19887.33,8,100
188845,2022-07-08,1,9223272807582961860,1,16572540399223272807582961860,471,19887.33,8,100
188846,2022-07-09,1,9223272807582961860,1,16573422619223272807582961860,312,9943.66,4,100
188847,2022-07-10,1,9223272807582961860,1,16574340469223272807582961860,146,14915.50,6,100
188848,2022-07-11,1,9223272807582961860,1,16575141359223272807582961860,1946,4971.83,2,100

In [285]:
df_f.groupby('exp_group')\
    .agg({'secs_pay_ses':'mean'})

           secs_pay_ses
exp_group
0              6.922402
1              7.145106

In [214]:
df_f[df_f['user_id']==3253297642743067]

,date,exp_group,user_id,conversion,session_id,sum_ses_len,rev,sum_quant
19,2022-06-22 00:00:00,1,3253297642743067,1,16558936393253297642743067,1703,4040.05,3